Revit 2027 API
TableData.GetSectionData(SectionType) Method
 Returns the pointer to the section data array element at the specified section type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TableSectionData GetSectionData(
	SectionType sectionType
)
Public Function GetSectionData (
	sectionType As SectionType
) As TableSectionData
public:
TableSectionData^ GetSectionData(
	SectionType sectionType
)
member GetSectionData :
        sectionType : SectionType -> TableSectionData
Parameters
sectionType SectionType
 The section type of section data array. If the integral value of the section type is out of the boundary of section data array, null is returned.
Return Value
TableSectionData
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
TableData Class
GetSectionData Overload
Autodesk.Revit.DB Namespace